In [2]:
#Merge : 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 데이터베이스 테이블 조인과 같이 두 개의 테이블을 합친다.
# 기준이 되는 데이터를 키(key)라고 한다.

In [3]:
import pandas as pd
import numpy as np

In [5]:
# merge 예제1
df1 = pd.DataFrame({
    '고객번호' : [1001, 1002, 1003, 1004, 105, 1006, 1007],
    '이름' : ['둘리','도우너','또치','길동','희동','마이콜','영희']
    }, columns=['고객번호','이름']
)
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4   105   희동
5  1006  마이콜
6  1007   영희

In [6]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 300000]
    }, columns=['고객번호', '금액']
)
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001  300000

In [7]:
# merge 명령 -> 두 데이터 프레임 공통 열인 고객번호열을 기준으로 데이터를 찾아서 함침
pd.merge(df1, df2)

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리  300000
3  1006  마이콜    5000

In [8]:
pd.merge(df1, df2, how='outer') #outer 조인 : 양쪽 데이터 모두 보여줌

    고객번호   이름        금액
0   1001   둘리   10000.0
1   1001   둘리   20000.0
2   1001   둘리  300000.0
3   1002  도우너       NaN
4   1003   또치       NaN
5   1004   길동       NaN
6    105   희동       NaN
7   1006  마이콜    5000.0
8   1007   영희       NaN
9   1005  NaN   15000.0
10  1008  NaN  100000.0

In [9]:
pd.merge(df1, df2, how='left')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리  300000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6   105   희동       NaN
7  1006  마이콜    5000.0
8  1007   영희       NaN

In [10]:
pd.merge(df1, df2, how = 'right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리  300000
3  1006  마이콜    5000
4  1005  NaN   15000
5  1008  NaN  100000

In [11]:
# merge 예제2 : 테이블에 키 값이 같은 데이터가 여러개 있는 경우 경우의 수를 따져 조합을 생성
df1 = pd.DataFrame({'key': ['setosa', 'setosa', 'virginica', 'versicolor'],
                    'petal length': [1.4, 1.3, 1.5, 1.3]})
df1

          key  petal length
0      setosa           1.4
1      setosa           1.3
2   virginica           1.5
3  versicolor           1.3

In [12]:
df2 = pd.DataFrame({'key': ['setosa', 'virginica', 'virginica', 'versicolor'],
                    'petal width': [0.4, 0.3, 0.5, 0.3]})
df2

          key  petal width
0      setosa          0.4
1   virginica          0.3
2   virginica          0.5
3  versicolor          0.3

In [13]:
pd.merge(df1, df2)

          key  petal length  petal width
0      setosa           1.4          0.4
1      setosa           1.3          0.4
2   virginica           1.5          0.3
3   virginica           1.5          0.5
4  versicolor           1.3          0.3

In [14]:
# merge 예제3
df1 = pd.DataFrame({'성별': ['남자', '남자', '여자'],
                    '연령': ['미성년자', '성인', '미성년자'],
                    '매출1': [1,2,3]})
df1

   매출1  성별    연령
0    1  남자  미성년자
1    2  남자    성인
2    3  여자  미성년자

In [15]:
df2 = pd.DataFrame({'성별': ['남자', '남자', '여자', '여자'],
                    '연령': ['미성년자', '미성년자', '미성년자', '성인'],
                    '매출2': [4,5,6,7]})
df2

   매출2  성별    연령
0    4  남자  미성년자
1    5  남자  미성년자
2    6  여자  미성년자
3    7  여자    성인

In [16]:
pd.merge(df1, df2, how='outer')

   매출1  성별    연령  매출2
0  1.0  남자  미성년자  4.0
1  1.0  남자  미성년자  5.0
2  2.0  남자    성인  NaN
3  3.0  여자  미성년자  6.0
4  NaN  여자    성인  7.0

In [17]:
pd.merge(df1, df2, on=['성별', '연령'], how='outer') #on : 기준 열 명시적 설정

   매출1  성별    연령  매출2
0  1.0  남자  미성년자  4.0
1  1.0  남자  미성년자  5.0
2  2.0  남자    성인  NaN
3  3.0  여자  미성년자  6.0
4  NaN  여자    성인  7.0

In [18]:
pd.merge(df1, df2, on='성별') #기준 열이 아니면서 이름이 같은 열에는 _x or _y같은 접미사가 붙음

   매출1  성별  연령_x  매출2  연령_y
0    1  남자  미성년자    4  미성년자
1    1  남자  미성년자    5  미성년자
2    2  남자    성인    4  미성년자
3    2  남자    성인    5  미성년자
4    3  여자  미성년자    6  미성년자
5    3  여자  미성년자    7    성인

In [22]:
# merge 예제4
df1 = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                    'key2': ['one', 'two', 'three'],
                    'lval': [1,2,3]})
df1

  key1   key2  lval
0  foo    one     1
1  foo    two     2
2  bar  three     3

In [20]:
df2 = pd.DataFrame({'k1': ['foo', 'foo', 'bar', 'bar'],
                    'k2': ['one', 'one', 'one', 'two'],
                    'rval': [4,5,6,7]})
df2

    k1   k2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [23]:
pd.merge(df1, df2, left_on='key1', right_on='k1')

  key1   key2  lval   k1   k2  rval
0  foo    one     1  foo  one     4
1  foo    one     1  foo  one     5
2  foo    two     2  foo  one     4
3  foo    two     2  foo  one     5
4  bar  three     3  bar  one     6
5  bar  three     3  bar  two     7

# merge 예제5

#### 일반 데이터 열이 아닌 인덱스를 기준열로 사용할 경우 : left_index or right_index 인수를 True로 설정

In [24]:
df1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [25]:
df2 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
df2

   group_val
a        3.5
b        7.0

In [26]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

# merge 예제6

In [29]:
df1 = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                    'key2': [2000, 2001, 2002, 2001, 2002],
                    'data': np.arange(5.)})
df1

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [31]:
df2 = pd.DataFrame(np.arange(12).reshape((6,2)),
                   index=[['Nevada', 'Neveda', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                          [2001, 2000, 2000, 2000, 2001, 2002]],
                   columns=['event1', 'event2'])
df2

             event1  event2
Nevada 2001       0       1
Neveda 2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [32]:
pd.merge(df1, df2, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

# merge 예제7

In [35]:
df1 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                   index=['a', 'c', 'e'],
                   columns=['Ohio', 'Nevada'])
df1

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [36]:
df2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                   index=['b', 'c', 'd', 'e'],
                   columns=['Missouri', 'Alabama'])
df2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [37]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

# join 메서드

#### merge 명령어 대신 join 메서드 사용 가능

In [44]:
df1.join(df2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

#### 연습문제1. 두 개의 데이터 프레임을 만들고 merge 명령으로 합친다.
##### 1.각각 5x5 이상의 크기를 가진다
##### 2.공통 열을 하나 이상 가진다. 다만 공통 열의 이름은 서로 다르다.

In [48]:
d1 = pd.DataFrame({'A': [18, 20, 8, 11, 14],
                   'B': [10000, 20000, 5000, 100000, 300000],
                   'C': [0,1,5,8,9],
                   'D': ['혜화', '대화', '오금', '신촌기차역', '동교동 삼거리'],
                   'E': ['지하척', '지하척', '지하철', '버스', '버스']})
d1

    A       B  C        D    E
0  18   10000  0       혜화  지하척
1  20   20000  1       대화  지하척
2   8    5000  5       오금  지하철
3  11  100000  8    신촌기차역   버스
4  14  300000  9  동교동 삼거리   버스

In [50]:
d2 = pd.DataFrame({'A2': [18, 20, 8, 11, 14],
                   '지하철': ['1호선', '2호선', '3호선', '4호선', '5호선'],
                   '역명': ['청량리', '홍대입구', '수서', '오이도', '영등포구'],
                   '종점': ['Y', 'N', 'Y', 'Y', 'N'],
                   'What': ['B','NAd','GOGO','HOHO', 'Cookie']})
d2

   A2    What    역명 종점  지하철
0  18       B   청량리  Y  1호선
1  20     NAd  홍대입구  N  2호선
2   8    GOGO    수서  Y  3호선
3  11    HOHO   오이도  Y  4호선
4  14  Cookie  영등포구  N  5호선

In [57]:
pd.merge(d1, d2, left_on='A', right_on='A2', how='outer')

    A       B  C        D    E  A2    What    역명 종점  지하철
0  18   10000  0       혜화  지하척  18       B   청량리  Y  1호선
1  20   20000  1       대화  지하척  20     NAd  홍대입구  N  2호선
2   8    5000  5       오금  지하철   8    GOGO    수서  Y  3호선
3  11  100000  8    신촌기차역   버스  11    HOHO   오이도  Y  4호선
4  14  300000  9  동교동 삼거리   버스  14  Cookie  영등포구  N  5호선

# Concat
####  - concat : 기준열(key column)을 사용하지 않고 단순히 데이터를 추가
####  - 기본적으로는 아래데 데이터 행을 덧붙임(인덱스 중복) but axis=1인수 설정 : 인덱스 기준으로 옆으로 데이터를 덧붙임

In [58]:
s1 = pd.Series([0, 1], index=['a','b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [59]:
s1

a    0
b    1
dtype: int64

In [60]:
s2

c    2
d    3
e    4
dtype: int64

In [61]:
s3

f    5
g    6
dtype: int64

In [62]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [63]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [65]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [66]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a', 'b', 'c'], columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [67]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a', 'c'], columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [68]:
pd.concat([df1, df2])

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

In [69]:
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

# 연습문제2
#### 어느 회사에 전반기(1월 ~ 6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타ㅐ는 데이터 프레임을 만든 뒤 합친다. 실적 정보는 "매출", "비용", "이익"으로 이루어진다.(이익 = 매출 - 비용) 또한 1년간의 총실적을 마지막 행으로 덧붙인다.

In [91]:
fore = pd.DataFrame({"매출": [100000, 1524802, 500000, 985000, 548000, 4589052],
                     "비용": [10000, 58500, 12400, 56000, 85000, 4500]},
                     index = ["1월", "2월", "3월", "4월", "5월", "6월"])
fore

         매출     비용
1월   100000  10000
2월  1524802  58500
3월   500000  12400
4월   985000  56000
5월   548000  85000
6월  4589052   4500

In [92]:
post = pd.DataFrame({"매출": [15080, 240000, 360000, 489050, 456000, 77000],
                     "비용": [1500, 4890, 57000, 45000, 24000, 22000]},
                     index = ["7월", "8월", "9월", "10월", "11월", "12월"])
post

         매출     비용
7월    15080   1500
8월   240000   4890
9월   360000  57000
10월  489050  45000
11월  456000  24000
12월   77000  22000

In [99]:
fore["이익"] = fore["매출"] - fore["비용"]
fore

         매출     비용       이익
1월   100000  10000    90000
2월  1524802  58500  1466302
3월   500000  12400   487600
4월   985000  56000   929000
5월   548000  85000   463000
6월  4589052   4500  4584552

In [100]:
post["이익"] = post["매출"] - post["비용"]
post

         매출     비용      이익
7월    15080   1500   13580
8월   240000   4890  235110
9월   360000  57000  303000
10월  489050  45000  444050
11월  456000  24000  432000
12월   77000  22000   55000

In [103]:
year = pd.concat([fore, post])
year

          매출     비용       이익
1월    100000  10000    90000
2월   1524802  58500  1466302
3월    500000  12400   487600
4월    985000  56000   929000
5월    548000  85000   463000
6월   4589052   4500  4584552
7월     15080   1500    13580
8월    240000   4890   235110
9월    360000  57000   303000
10월   489050  45000   444050
11월   456000  24000   432000
12월    77000  22000    55000

In [108]:
year.loc["all", :] = year.sum()
year

             매출        비용          이익
1월     100000.0   10000.0     90000.0
2월    1524802.0   58500.0   1466302.0
3월     500000.0   12400.0    487600.0
4월     985000.0   56000.0    929000.0
5월     548000.0   85000.0    463000.0
6월    4589052.0    4500.0   4584552.0
7월      15080.0    1500.0     13580.0
8월     240000.0    4890.0    235110.0
9월     360000.0   57000.0    303000.0
10월    489050.0   45000.0    444050.0
11월    456000.0   24000.0    432000.0
12월     77000.0   22000.0     55000.0
all  19767968.0  761580.0  19006388.0